core/app/Http/Controllers/Landlord/Admin/TenantManageController.php

select * from `tenants` where `user_id` is not null order by `tenants`.`id` asc limit 100 offset 0
---
    public function all_tenants_list()
    {
        $all_tenants = \Cache::remember('all_tenants', 60 * 60, function () {
            $every = [];
            Tenant::whereNotNull('user_id')->chunk(100, function ($tenants) use (&$every) {
                foreach ($tenants as $tenant) {
                    $every[] = $tenant;
                }
            });